Repository: gnachman/iTerm2
Catalog: sources/OpenQuickly/mul.lproj/iTermPasteSpecialViewController.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# 5Lu-I0-zTV.title
source: Requires Shell Integration for prompt detection
de: Erfordert Shell-Integration zur Erkennung der Eingabeaufforderung
ja: プロンプト検出にはシェル統合が必要です
pt_br: Requer Shell Integration para detecção de prompt
ru: Для определения приглашения требуется интеграция с оболочкой
zh_hans: 提示符检测需要 Shell 集成

# 6tG-RX-FWF.ibShadowedToolTip
source: This is enabled when the running app has sent an escape code to turn on “bracketed paste mode.” The pasted string will be “bracketed” by escape codes indicating the text within is from a paste operation.
de: Diese Option wird aktiviert, wenn die laufende Anwendung eine Escape-Sequenz gesendet hat, um den „Bracketed Paste Mode“ einzuschalten. Die eingefügte Zeichenfolge wird durch Escape-Sequenzen „geklammert“, die anzeigen, dass der enthaltene Text aus einem Einfügevorgang stammt.
ja: 実行中のアプリが「Bracketed Paste Mode」をオンにするエスケープコードを送信すると有効になります。貼り付けられた文字列は、その内容が貼り付け操作によるものであることを示すエスケープコードで「囲まれ」ます。
pt_br: Isto é ativado quando o app em execução envia um código de escape para ativar o “modo de colagem entre delimitadores.” O texto colado será “delimitado” por códigos de escape que indicam que o conteúdo vem de uma operação de colagem.
ru: Эта функция включается, когда запущенное приложение отправило escape-код для включения режима «вставки в скобках». Вставляемая строка будет «обёрнута» escape-кодами, указывающими, что этот текст получен в результате операции вставки.
zh_hans: 当运行中的应用发送转义码开启“括号粘贴模式”时，此选项可用。粘贴的文本前后会添加转义码，让应用知道这段内容来自粘贴操作。

# 8UF-96-NRu.title
source: Escape tabs with ^V
de: Tabs mit ^V maskieren
ja: ^Vでタブをエスケープ
pt_br: Escapar tabulações com ^V
ru: Экранировать табуляции с помощью ^V
zh_hans: 使用 ^V 转义制表符

# 9FR-lE-vZJ.title
source: Paste with tabs
de: Mit Tabs einfügen
ja: タブ付きで貼り付け
pt_br: Colar com tabulações
ru: Вставлять с табуляциями
zh_hans: 带制表符粘贴

# 65A-9c-omm.title
source: Replace
de: Ersetzen
ja: 置換
pt_br: Substituir
ru: Заменить
zh_hans: 替换

# a6z-Q5-O3y.title
source: Convert Unicode punctuation
de: Unicode-Interpunktion konvertieren
ja: Unicodeの句読点を変換
pt_br: Converter pontuação Unicode
ru: Преобразовывать пунктуацию Unicode
zh_hans: 转换 Unicode 标点

# a9K-ff-GBV.title
source: Respects vim escape sequences
de: Berücksichtigt vim-Escape-Sequenzen
ja: vimのエスケープシーケンスに対応
pt_br: Respeita as sequências de escape do vim
ru: Учитывает escape-последовательности vim
zh_hans: 遵循 vim 转义序列

# C2O-DY-y76.ibShadowedToolTip
source: Converts various forms of quotation marks and dashes to their ASCII equivalents.
de: Wandelt verschiedene Formen von Anführungszeichen und Gedankenstrichen in ihre ASCII-Entsprechungen um.
ja: さまざまな形式の引用符やダッシュをASCII相当の文字に変換します。
pt_br: Converte várias formas de aspas e traços para seus equivalentes ASCII.
ru: Преобразует различные виды кавычек и тире в их эквиваленты ASCII.
zh_hans: 将各种形式的引号和破折号转换为 ASCII 等价形式。

# EeN-We-9AA.title
source: Convert tabs to spaces:
de: Tabs in Leerzeichen umwandeln:
ja: タブをスペースに変換:
pt_br: Converter tabulações em espaços:
ru: Преобразовывать табуляции в пробелы:
zh_hans: 将制表符转换为空格：

# FKu-pE-gGN.ibShadowedToolTip
source: Both DOS and UNIX newlines are generally not used as input. CR is standard.
de: Sowohl DOS- als auch UNIX-Zeilenumbrüche werden im Allgemeinen nicht als Eingabe verwendet. CR ist der Standard.
ja: DOSおよびUNIXの改行は通常、入力には使用されません。CRが標準です。
pt_br: As quebras de linha DOS e UNIX geralmente não são usadas como entrada. CR é o padrão.
ru: Как правило, ни DOS-, ни UNIX-переводы строк не используются в качестве ввода. Стандартом является CR.
zh_hans: DOS 和 UNIX 换行符通常不用于输入。CR 是标准。

# geX-hg-c5A.title
source: Escape shell characters with \
de: Shell-Zeichen mit \ maskieren
ja: シェル文字を\でエスケープ
pt_br: Escapar caracteres do shell com \
ru: Экранировать символы оболочки с помощью \
zh_hans: 使用 \ 对 shell 字符进行转义

# gmQ-6D-hd3.title
source: Chunk Size:
de: Blockgröße:
ja: チャンクサイズ:
pt_br: Tamanho do bloco:
ru: Размер фрагмента:
zh_hans: 块大小：

# hpt-tW-eP7.placeholderString
source: Substitution
de: Ersetzung
ja: 置換文字列
pt_br: Substituição
ru: Подстановка
zh_hans: 替换

# I7q-KH-dfd.ibShadowedToolTip
source: Both DOS and UNIX newlines are generally not used as input. CR is standard.
de: Sowohl DOS- als auch UNIX-Zeilenumbrüche werden im Allgemeinen nicht als Eingabe verwendet. CR ist der Standard.
ja: DOSおよびUNIXの改行は通常、入力には使用されません。CRが標準です。
pt_br: As quebras de linha DOS e UNIX geralmente não são usadas como entrada. CR é o padrão.
ru: Как правило, ни DOS-, ни UNIX-переводы строк не используются в качестве ввода. Стандартом является CR.
zh_hans: DOS 和 UNIX 换行符通常不用于输入。CR 是标准。

# ILq-w8-PQn.ibShadowedToolTip
source: Tab, line feed, form feed, and carriage return are the only “safe” control codes.
de: Tabulator, Zeilenvorschub, Seitenvorschub und Wagenrücklauf sind die einzigen „sicheren“ Steuerzeichen.
ja: タブ、ラインフィード、フォームフィード、キャリッジリターンのみが「安全な」制御コードです。
pt_br: Tabulação, avanço de linha, avanço de página e retorno de carro são os únicos códigos de controle “seguros”.
ru: Единственные «безопасные» управляющие коды: табуляция, перевод строки, перевод страницы и возврат каретки.
zh_hans: 制表符、换行符、换页符和回车符是仅有的“安全”控制码。

# IOU-ld-y0b.title
source: Transforms
de: Transformationen
ja: 変換
pt_br: Transformações
ru: Преобразования
zh_hans: 转换

# Iuq-a0-6jh.title
source: ICU regular expression syntax
de: ICU-Syntax für reguläre Ausdrücke
ja: ICU正規表現構文
pt_br: Sintaxe de expressão regular ICU
ru: Синтаксис регулярных выражений ICU
zh_hans: ICU 正则表达式语法

# M1n-rk-o3M.title
source: with
de: mit
pt_br: com
ru: на
zh_hans: 使用

# mzg-ua-zxf.title
source: Speed
de: Geschwindigkeit
ja: 速度
pt_br: Velocidade
ru: Скорость
zh_hans: 速度

# Nc9-bk-vWI.title
source: Remove unsafe control codes
de: Unsichere Steuerzeichen entfernen
ja: 安全でない制御コードを削除
pt_br: Remover códigos de controle inseguros
ru: Удалять небезопасные управляющие коды
zh_hans: 移除不安全控制码

# nQ4-xf-lMs.title
source: Wait for shell prompt before pasting each line
de: Vor dem Einfügen jeder Zeile auf die Shell-Eingabeaufforderung warten
ja: 各行を貼り付ける前にシェルプロンプトを待つ
pt_br: Aguardar o prompt do shell antes de colar cada linha
ru: Ожидать приглашение оболочки перед вставкой каждой строки
zh_hans: 粘贴每行前等待 Shell 提示符

# oIL-MU-4nf.title
source: Interchunk Delay:
de: Verzögerung zwischen Blöcken:
ja: チャンク間の遅延:
pt_br: Atraso entre blocos:
ru: Задержка между фрагментами:
zh_hans: 块间延迟：

# Qmg-L3-fKu.placeholderString
source: Regular Expression
de: Regulärer Ausdruck
ja: 正規表現
pt_br: Expressão regular
ru: Регулярное выражение
zh_hans: 正则表达式

# TcS-Fq-kZn.title
source: Remove newlines
de: Zeilenumbrüche entfernen
ja: 改行を削除
pt_br: Remover quebras de linha
ru: Удалять переводы строк
zh_hans: 移除换行符

# tpG-Jk-bWC.title
source: Use $1, $2, etc. for capture groups
de: Verwenden Sie $1, $2 usw. für Erfassungsgruppen
ja: キャプチャグループには $1, $2 などを使用
pt_br: Use $1, $2 etc. para grupos de captura
ru: Используйте $1, $2 и т. д. для групп захвата
zh_hans: 使用 $1、$2 等作为捕获组

# YGo-el-jcx.title
source: Convert CRLF and LF to CR
de: CRLF und LF in CR umwandeln
ja: CRLFとLFをCRに変換
pt_br: Converter CRLF e LF em CR
ru: Преобразовывать CRLF и LF в CR
zh_hans: 将 CRLF 和 LF 转换为 CR

# YXc-NP-geE.title
source: Base-64 encode
de: Base64-kodieren
ja: Base64エンコード
pt_br: Codificar em Base-64
ru: Кодировать в Base64
zh_hans: Base64 编码

# zMi-ws-xdZ.title
source: 10 sec
de: 10 s
ja: 10秒
pt_br: 10 s
ru: 10 с

# Ba7-4w-YL4.title
source: 1 ms
ja: 1ミリ秒
ru: 1 мс

# J7i-FI-poE.title
source: 100 ms
ja: 100ミリ秒
ru: 100 мс

# q05-F1-Nx6.title
source: 1 byte
ja: 1バイト
ru: 1 байт

# Rzy-TP-eag.title
source: 150 ms
ja: 150ミリ秒
ru: 150 мс

# T6S-me-J0t.title
source: Radio
ja: ラジオ
ru: Радио
zh_hans: 单选按钮

# lBa-zz-w0b.title
source: 1 kB
ru: 1 КБ

# RNM-1C-IVn.title
source: 1.2 kB
ru: 1,2 КБ

# vTr-f3-LoJ.title
source: Bracketed paste mode
pt_br: Modo de colagem entre delimitadores
ru: Режим вставки в скобках
zh_hans: 括号粘贴模式

# WDY-mt-Qhp.title
source: 1 MB
ru: 1 МБ
